[AdvMEC_RC X2CharacterTemplate]
strCharacterName="防暴 MEC"

[AdvMEC_RCM2 X2CharacterTemplate]
strCharacterName="防爆MEC贰型"

[RC_ADV_Bit X2CharacterTemplate]
strCharacterName="安全位"

[RC_ADV_Bit2 X2CharacterTemplate]
strCharacterName="高级安全位"

[SectopodMini X2CharacterTemplate]
strCharacterName="破环者猎人"

[SectopodMini2 X2CharacterTemplate]
strCharacterName="破环者猎人"

[SectopodRoyal X2CharacterTemplate]
strCharacterName="破环者歼灭者"

[AdvMEC_RC_WPN X2WeaponTemplate]
FriendlyName="变种人磁力大炮"


[TaserPunch X2AbilityTemplate]
LocFriendlyName="泰瑟枪"
LocLongDescription="击打目标并造成轻微伤害。可使其昏迷和迷失方向。"
LocHelpText="击打目标并造成轻微伤害。可使其昏迷和迷失方向。"
LocFlyOverText="泰瑟枪冲击器。"

[TaserPunch2 X2AbilityTemplate]
LocFriendlyName="泰瑟枪"
LocLongDescription="击打目标造成轻微伤害。可击晕和迷惑"
LocHelpText="击打目标并造成轻微伤害。可使其昏迷和迷失方向。"
LocFlyOverText="泰瑟枪冲击器。"

[FlashBangMunitions X2AbilityTemplate]
LocFriendlyName="FlashBang 弹药"
LocLongDescription="防暴 MEC 的肩扛式发射器可以发射一连串闪光弹，使爆炸范围内的人员迷失方向。"
LocHelpText="防暴 MEC 的肩扛式发射器可以齐射闪光弹，使爆炸范围内的人员迷失方向。"

[AdvBitRepair X2AbilityTemplate]
LocFriendlyName="修复"
LocLongDescription="安全 BIT 可以修复受损机器人盟友的 4 点生命值，并焊接 1 件新装甲。如果没有受损盟友，仍会添加装甲。"
LocHelpText="安全 BIT 可以修复受损机器人盟友的 4 点生命值，并焊接 1 件新装甲。如果没有受损盟友，仍会添加装甲。"

[AdvBitRepair2 X2AbilityTemplate]
LocFriendlyName="高级修复"
LocLongDescription="高级安全 BIT 将修复受损机器人盟友的 6 点生命值，并焊接 2 件新装甲。如果没有受损盟友，仍会添加装甲。"
LocHelpText="高级安全 BIT 将修复受损机器人盟友的 6 点生命值，并焊接 2 件新装甲。如果没有受损盟友，仍会添加装甲。"

[RC_BITScanningProtocol X2AbilityTemplate]
LocFriendlyName="搜索协议"
LocLongDescription="安全 BIT 可以触发对该区域的即时扫描，在 2 个回合内大幅增加其自身的视野半径，从而揭示视野中任何隐藏或伪装的敌人。"
LocHelpText="安全 BIT 可以触发对该区域的即时扫描，在 2 个回合内大幅增加其自身的视野半径，从而揭示视野中任何隐藏或伪装的敌人。"

[Hunter_Whiplash X2AbilityTemplate]
LocFriendlyName="猎人鞭笞"
LocLongDescription="使用电击攻击敌人。对机器人单位造成双倍伤害。电击攻击无视护甲。"
LocHelpText="使用电击攻击敌人。对机器人单位造成双倍伤害。电击攻击无视护甲。"

[SectoKillZone X2AbilityTemplate]
LocFriendlyName="杀戮地带"
LocLongDescription="对任何在射击范围内移动或攻击的敌人进行反应射击。"
LocHelpText="增强小队视线监视。对任何在射击范围内移动或攻击的敌人进行反应射击。"
LocFlyOverText="杀戮地带"

[SectopodImmunities X2AbilityTemplate]
LocFriendlyName="破环者免疫"
LocLongDescription="破坏者对火焰、所有毒药和精神攻击免疫。"
LocHelpText="破环者免疫火焰、所有毒药和精神攻击。"


[SectoHelp X2AbilityTemplate]
LocFriendlyName="机器人增援"
LocLongDescription="呼叫随机机器人增援。"
LocHelpText="呼叫随机机器人增援。"



[MRSabotageCC X2MissionTemplate]
DisplayName="破坏变种人纪念碑并避开安保机器人"
Briefing="破坏变种人纪念碑并避开安全机器人"
PostMissionType="破坏变种人纪念碑并避开安保机器人"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="消灭所有敌军"
ObjectiveTextPools[1]="在纪念碑上安装 X4"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.SabotageCC.T_SabotageCC_Narrative_Wrappers_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.SabotageCC.T_SabotageCC_Narrative_Wrappers_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.SabotageCC.T_SabotageCC_Narrative_Wrappers_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.SabotageCC.T_SabotageCC_Narrative_Wrappers_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.SabotageCC.T_SabotageCC_Narrative_Wrappers_05"

[MRSabotageCC X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="与抵抗军实地行动人员会合"
ObjectiveTextPools[1]="消灭所有敌方目标"
ObjectiveTextPools[2]="在纪念碑上放置 X4 炸药"



[MRCompoundRescueOperative X2MissionTemplate]
DisplayName="从变种人建筑中救出特工并避开安保机器人"
Briefing="从变种人建筑中救出特工并避开安保机器人"
PostMissionType="从变种人建筑中营救特工并避开安保机器人"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="从变种人牢房中营救特工"
PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Compound_Rescue_Dropship_Intro_A"
PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Compound_Rescue_Dropship_Intro_B"
PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Compound_Rescue_Dropship_Intro_C"

[MRCompoundRescueOperative X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="直到天际游侠必须撤退为止"
ObjectiveTextPools[1]="从变种人建筑中营救 XCOM 特工"
ObjectiveTextPools[2]="救出获救人员"
ObjectiveTextPools[3]="提取所有 XCOM 士兵"



[MRRescueAdventCell X2MissionTemplate]
DisplayName="从变种人建筑中救出 VIP 并避开安全机器人"
Briefing="从变种人建筑中救出 VIP 并避开安全机器人"
PostMissionType="提取VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="从变种人的监视下营救 VIP"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_05"

[MRRescueAdventCell X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="直到天际游侠必须撤退为止"
ObjectiveTextPools[1]="从变种人监狱救出 VIP"
ObjectiveTextPools[2]="在指定地点提取VIP"
ObjectiveTextPools[3]="提取所有 XCOM 士兵"


[MRRescueVehicle X2MissionTemplate]
DisplayName="从变种人车辆中救出 VIP 并避开安全机器人"
Briefing="从 ADVENT 车辆中救出 VIP 并避开安全机器人"
PostMissionType="提取VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="从变种人的监视下营救 VIP"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_Vehicle_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_Vehicle_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_Vehicle_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_Vehicle_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_Vehicle_05"


[MRRescueVehicle X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="直到天际游侠必须撤退为止"
ObjectiveTextPools[1]="从变种人车辆中救出 VIP"
ObjectiveTextPools[2]="在指定地点提取VIP"
ObjectiveTextPools[3]="提取所有 XCOM 士兵"



[MRExtract X2MissionTemplate]
DisplayName="从变种人建筑中提取 VIP 并避开安全机器人"
Briefing="从变种人建筑中取出 VIP 并避开安全机器人"
PostMissionType="提取VIP"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="将 VIP 送至提取点"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Extract.Central_Council_Missions_Extract_VIP_05"

[MRExtract X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="直到天际游侠必须撤退为止"
ObjectiveTextPools[1]="在指定地点提取VIP"
ObjectiveTextPools[2]="撤出所有 XCOM 士兵"


[MRSupplyExtraction X2MissionTemplate]
DisplayName="避开自动防御并提取变种人补给"
Briefing="变种人在该地区有补给。侦察报告显示变种人的数量要少得多，但自动防御系统却比平时更大。可能是为了保护补给而设置的。"
PostMissionType="避开自动防御并提取变种人补给"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="保护并提取变种人补给"
ObjectiveTextPools[1]="消灭所有敌方目标"
PreMissionNarratives[0]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_A"
PreMissionNarratives[1]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_B"
PreMissionNarratives[2]="XPACK_NarrativeMoments.X2_XP_CEN_T_Extract_Supplies_Dropship_Intro_C"

[MRSupplyExtraction X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="标记并恢复变种人补给箱"
ObjectiveTextPools[1]="消灭所有敌方目标"
ObjectiveTextPools[2]="撤出所有 XCOM 士兵"
ObjectiveTextPools[3]="或：消灭所有剩余敌对目标"


[MRSabotageAlienFacility X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="植入 X4 以摧毁破环者测试设施"
ObjectiveTextPools[1]="提取所有 XCOM 士兵"
ObjectiveTextPools[2]="呼叫空中游侠并撤出所有士兵以完成此任务。"
ObjectiveTextPools[3]="刀片测试2"
ObjectiveTextPools[4]="刀片测试3"


[MRSabotageAlienFacility X2MissionTemplate]
DisplayName="破坏破环者测试设施"
Briefing="破坏破环者测试设施"
PostMissionType="破坏破环者测试设施"
BriefingImage="img:///UILibrary_StrategyImages.X2StrategyMap.Alert_Advent_Facility"
ObjectiveTextPools[0]="将 X4 炸药放入破环者测试设施"
ObjectiveTextPools[1]="逃离行动区域"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Sabotage.T_Sabotage_Narrative_Wrappers_05"
